app/controllers/admin/user_sessions_controller.rb

    def create
      @admin = User.find_by_login(params[:user_session][:login])
---
SELECT * FROM "users" WHERE ("users"."login" = 'admin') LIMIT 1