app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login", "email") VALUES('2009-04-15 13:26:05', 'b39d70986df8f234187d289b09869b1dc1eab6fb58922f37662c892d6a726d749397c6c8dd7bafa404e90b5a301f4ecd172776c7078adf43401671112ac6f087', '2009-04-15 13:26:05', '0VBMUwIlY0a10_erFAZ5', '1299ef0c19d0faf70bb3f61ef79bdd5cbd4bda66520b92531bf443f857f95cf42fdd3cfc95e8507ba7fe2da5448366d9bac0d1fa674daf0f77cb4090c910e2af', 'holmic', 'mholub@railsware.com')